import { getLocales } from 'expo-localization';
import { I18n } from 'i18n-js';

// Set the key-value pairs for the different languages you want to support.
const i18n = new I18n({
  en: { welcome: 'Hello' },
  ar: {
    welcome: 'تنطلق النسخة الثانية من ملتقى الفكر العربي للتعليم والتدريب Arab Expo 2025 بفندق ميراج بالإسكندرية، تحت عنوان: إعداد المعلمين والمدربين في ضوء مهارات القرن الحادي والعشرين. يهدف الملتقى إلى استعراض أحدث الاتجاهات والأساليب في تطوير المعلم لمواكبة متطلبات التعليم الحديثة. ويعد فرصة مميزة لخبراء التعليم والمؤسسات لاستكشاف حلول مبتكرة تعزز من كفاءة المعلم في عصر التحول الرقمي.',
    register: 'الاشتراك',
    moreText: 'لقطات من ARAB EXPO 2024',
    darkMode: 'الوضع الليلي',
    about: 'من نحن',
    contactUs: 'تواصل معنا',
    extraText: `بكل فخر واعتزاز، نحتفي بالنجاح الكبير الذي حققه ملتقى ARAB EXPO 2024 في نسخته الأولى، والذي جمع نخبة من الخبراء ورواد التعليم والتدريب في العالم العربي تحت سقف واحد، ليكون منبرًا للإبداع، وتبادل الخبرات، واستشراف مستقبل التعليم في منطقتنا.

لقد كان الحدث منصة متميزة للابتكار والتطوير، حيث أسهم في إثراء الحوار حول أحدث استراتيجيات التعليم والتدريب، وفتح آفاقًا جديدة للشراكات والتعاون بين المؤسسات التعليمية والتدريبية.

ومع هذا النجاح المُلهم، تتطلع مؤسسة I Can Read بشغف إلى نسخة 2025، واضعة نصب أعينها المزيد من التميز والإبداع، لترسيخ دورها الريادي في دعم التعليم والتطوير في العالم العربي.`
   },
});

// Set the locale once at the beginning of your app.
// i18n.locale = getLocales()[0].languageCode;
i18n.locale = 'ar';

export default i18n;